ERM/src/DataProcessors/ГрупповоеСозданиеКорректировокТранзакций/ГрупповоеСозданиеКорректировокТранзакций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрупповоеСозданиеКорректировокТранзакций</name>
</mdclass:DataProcessor>

ERM/src/Documents/КорректировкаТранзакции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КорректировкаТранзакции</Name>
			<BasedOn>
				<xr:Item>Document.ТранзакцияHOB</xr:Item>
				<xr:Item>Document.ТранзакцияOracle</xr:Item>
				<xr:Item>Document.ПроводкаDSS</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.BilledAR</xr:Item>
				<xr:Item>AccumulationRegister.Payments</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedCash</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedMemo</xr:Item>
				<xr:Item>AccumulationRegister.Revenue</xr:Item>
				<xr:Item>AccumulationRegister.ManualTransactions</xr:Item>
				<xr:Item>AccumulationRegister.UnbilledAR</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроводкаDSS</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранзакцияOracle</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранзакцияHOB</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДетализацияПоКлиенту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BaseAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/Documents/ТранзакцияHOB.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ТранзакцияHOB</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.BilledAR</xr:Item>
				<xr:Item>AccumulationRegister.Payments</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedCash</xr:Item>
				<xr:Item>InformationRegister.ПериодыАктивностиДоговоров</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedMemo</xr:Item>
				<xr:Item>AccumulationRegister.Revenue</xr:Item>
				<xr:Item>AccumulationRegister.ManualTransactions</xr:Item>
				<xr:Item>AccumulationRegister.UnbilledAR</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>TransactionType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HOBTransactionType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Comment>Код операционной единицы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExchangeRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Contract</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SalesOrderID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InvoiceID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CREW</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Reverse</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HOBDocumentType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HOBDocumentTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HOBInvoiceType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HOBDocumentTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CustomerNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HOBReverseType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.HOBDocumentTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorAccount</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndClient</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/DataProcessors/ГрупповоеСозданиеКорректировокТранзакций/Forms/Форма/Module.bsl
&НаСервере
Процедура СформироватьКорректировкиТранзакцийНаСервере()
	
	НачатьТранзакцию();
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Для каждого СтрокаТранзакции Из ТаблицаТранзакций Цикл
		
		Если Не СтрокаТранзакции.Apply Тогда
			Продолжить;
		КонецЕсли;
		
		КорректировкаТразакции = Документы.КорректировкаТранзакции.СоздатьДокумент();
		КорректировкаТразакции.Дата = ТекущаяДата();
		КорректировкаТразакции.ДокументОснование = СтрокаТранзакции.Ссылка;
		ЗаполнитьЗначенияСвойств(КорректировкаТразакции, СтрокаТранзакции, "Company,Account,Currency,AU,LegalEntity");
		СтрокаТабЧасти = КорректировкаТразакции.ДетализацияПоКлиенту.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, СтрокаТранзакции);
		СтрокаТабЧасти.Client = НовыйКлинет;
		КорректировкаТразакции.Комментарий = "The document was created using Group creation of Transaction adjustment for changes client""";
		КорректировкаТразакции.Ответственный = ТекущийПользователь;
		КорректировкаТразакции.Записать(РежимЗаписиДокумента.Запись);
		
		ТекДок = КорректировкаТразакции.Ссылка.ПолучитьОбъект();
		Попытка
			ТекДок.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не удалось записать """ + ТекДок + """! ");
			ОтменитьТранзакцию();
		КонецПопытки;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Transaction adjustments created!");
	
	ЗафиксироватьТранзакцию();
	
	ОтобразитьТранзакцииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКорректировкиТранзакций(Команда)
	СформироватьКорректировкиТранзакцийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаТаблицы Из ТаблицаТранзакций Цикл
		СтрокаТаблицы.Apply = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаТаблицы Из ТаблицаТранзакций Цикл
		СтрокаТаблицы.Apply = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьТранзакцииНаСервере()
	
	Если Source = Перечисления.ТипыСоответствий.HOBs Тогда
		ТЗ_Транзакций = ПолучитьТранзакцииHOBs();
	ИначеЕсли Source = Перечисления.ТипыСоответствий.Lawson Тогда
		ТЗ_Транзакций = ПолучитьТранзакцииLawson();
	ИначеЕсли Source = Перечисления.ТипыСоответствий.OracleMI ИЛИ Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
		ТЗ_Транзакций = ПолучитьТранзакцииOracle();
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТЗ_Транзакций, "ТаблицаТранзакций");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТранзакцииHOBs()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Apply,
		|	ТранзакцияHOB.Номер,
		|	ТранзакцияHOB.Account,
		|	ТранзакцияHOB.Amount,
		|	ТранзакцияHOB.BaseAmount,
		|	ТранзакцияHOB.Client,
		|	ТранзакцияHOB.Company,
		|	ТранзакцияHOB.Currency,
		|	ТранзакцияHOB.CustomerNumber,
		|	"""" КАК CreatedByName,
		|	"""" КАК Description,
		|	ТранзакцияHOB.AU,
		|	ТранзакцияHOB.LegalEntity,
		|	ТранзакцияHOB.Ссылка
		|ИЗ
		|	Документ.ТранзакцияHOB КАК ТранзакцияHOB
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаТранзакции КАК КорректировкаТранзакции
		|		ПО ТранзакцияHOB.Ссылка = КорректировкаТранзакции.ДокументОснование
		|			И (НЕ КорректировкаТранзакции.ПометкаУдаления)
		|ГДЕ
		|	ТранзакцияHOB.Проведен
		|	И ТранзакцияHOB.Дата <= &ДатаОкончания
		|	И ТранзакцияHOB.Дата >= &ДатаНачала
		|	И ВЫБОР
		|			КОГДА &Company = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТранзакцияHOB.Company = &Company
		|		КОНЕЦ
		|	И ТранзакцияHOB.Client.Предопределенный
		|	И ВЫБОР
		|			КОГДА &AU = ЗНАЧЕНИЕ(Справочник.КостЦентры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТранзакцияHOB.AU = &AU
		|		КОНЕЦ
		|	И КорректировкаТранзакции.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("AU", AU);
	Запрос.УстановитьПараметр("Company", Company);
	Запрос.УстановитьПараметр("Source", Source);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьТранзакцииLawson()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Apply,
		|	ПроводкаDSS.Номер,
		|	ПроводкаDSS.Company,
		|	ПроводкаDSS.Currency,
		|	ПроводкаDSS.Description,
		|	ПроводкаDSS.CustomerNumber,
		|	"""" КАК CreatedByName,
		|	ПроводкаDSS.AU,
		|	ПроводкаDSS.LegalEntity,
		|	ПроводкаDSS.AccountLawson КАК Account,
		|	ПроводкаDSS.КонтрагентLawson КАК Client,
		|	ПроводкаDSS.TranAmount КАК Amount,
		|	ПроводкаDSS.BaseAmount,
		|	ПроводкаDSS.Ссылка
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаТранзакции КАК КорректировкаТранзакции
		|		ПО ПроводкаDSS.Ссылка = КорректировкаТранзакции.ДокументОснование
		|			И (НЕ КорректировкаТранзакции.ПометкаУдаления)
		|ГДЕ
		|	ПроводкаDSS.Проведен
		|	И ПроводкаDSS.DateLawson <= &ДатаОкончания
		|	И ПроводкаDSS.DateLawson >= &ДатаНачала
		|	И ВЫБОР
		|			КОГДА &Company = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПроводкаDSS.Company = &Company
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &AU = ЗНАЧЕНИЕ(Справочник.КостЦентры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПроводкаDSS.AU = &AU
		|		КОНЕЦ
		|	И ПроводкаDSS.КонтрагентLawson.Предопределенный
		|	И КорректировкаТранзакции.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("AU", AU);
	Запрос.УстановитьПараметр("Company", Company);
	Запрос.УстановитьПараметр("Source", Source);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьТранзакцииOracle()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Apply,
		|	ТранзакцияOracle.Номер,
		|	ТранзакцияOracle.Account,
		|	ТранзакцияOracle.Amount,
		|	ТранзакцияOracle.BaseAmount,
		|	ТранзакцияOracle.Client,
		|	ТранзакцияOracle.Company,
		|	ТранзакцияOracle.Currency,
		|	ТранзакцияOracle.Description,
		|	ТранзакцияOracle.CustomerNumber,
		|	ТранзакцияOracle.CreatedByName,
		|	ТранзакцияOracle.AU,
		|	ТранзакцияOracle.LegalEntity,
		|	ТранзакцияOracle.Ссылка
		|ИЗ
		|	Документ.ТранзакцияOracle КАК ТранзакцияOracle
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаТранзакции КАК КорректировкаТранзакции
		|		ПО ТранзакцияOracle.Ссылка = КорректировкаТранзакции.ДокументОснование
		|			И (НЕ КорректировкаТранзакции.ПометкаУдаления)
		|ГДЕ
		|	ТранзакцияOracle.Проведен
		|	И ТранзакцияOracle.Дата <= &ДатаОкончания
		|	И ТранзакцияOracle.Дата >= &ДатаНачала
		|	И ВЫБОР
		|			КОГДА &Company = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТранзакцияOracle.Company = &Company
		|		КОНЕЦ
		|	И ТранзакцияOracle.Client.Предопределенный
		|	И ТранзакцияOracle.Source = &Source
		|	И ВЫБОР
		|			КОГДА &AU = ЗНАЧЕНИЕ(Справочник.КостЦентры.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТранзакцияOracle.AU = &AU
		|		КОНЕЦ
		|	И КорректировкаТранзакции.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("AU", AU);
	Запрос.УстановитьПараметр("Company", Company);
	Запрос.УстановитьПараметр("Source", Source);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьТранзакции(Команда)
	ОтобразитьТранзакцииНаСервере();
КонецПроцедуры
